{
  "backend/main.mo": "Main Motoko actor defining data types (HealthcareService, InsuranceTerm, AssistanceProgram, CommunityResource with lat/lng) and persistent maps, with functions to initialize sample Leominster-area data and query each collection sorted alphabetically.",
  "backend/migration.mo": "Migration module that upgrades the CommunityResource type by adding optional lat and lng Float fields (defaulting to null) to all existing records while preserving all other actor state.",
  "feature_evidence.json": "Feature evidence report listing implemented features with file references, component dependencies, test IDs, and confidence levels, covering geocoding via Nominatim, lat/lng resource data, and haversine distance sorting.",
  "frontend-file-summaries.txt": "JSON map of frontend source file paths to one-sentence summaries describing each file's role, covering pages, components, hooks, and utilities in the React app.",
  "frontend/index.css": "Global Tailwind CSS entry point defining CSS custom property design tokens for light and dark themes (colors, radius, chart, sidebar variables) applied via @layer base.",
  "frontend/index.html": "Minimal HTML shell that mounts the React app into a #root div and loads the main.tsx module entry point.",
  "frontend/public/google1953233d208de426.html": "Static Google Search Console site verification file containing only the standard verification token string.",
  "frontend/public/site-verification.html": "Static placeholder HTML page served at /site-verification.html, intended for site verification tools or general static content with basic centered styling.",
  "frontend/src/App.tsx": "Root React application file that configures TanStack Router with a persistent Navigation/Footer layout and registers ten page routes covering all major app sections.",
  "frontend/src/components/CalloutBox.tsx": "Reusable callout/alert box component supporting four variants (info, tip, warning, right) with corresponding icons, colors, and border styles from the design system.",
  "frontend/src/components/ChecklistSection.tsx": "Checklist UI component that renders a titled group of checkbox items with completion tracking, strikethrough on checked items, and optional detail text per item.",
  "frontend/src/components/GuideStep.tsx": "Renders a numbered guide step with a title, connector line, and child content for use in step-by-step guides.",
  "frontend/src/components/HeroSection.tsx": "Displays the homepage hero section with a banner image, headline, CTA buttons, and a stats bar highlighting community focus, free guidance, and local coverage.",
  "frontend/src/components/InsuranceTermCard.tsx": "Renders a card displaying an insurance term and its definition from the backend InsuranceTerm type.",
  "frontend/src/components/JourneyCard.tsx": "Displays a healthcare journey card with an icon, title, description, step count, and a link to start the journey.",
  "frontend/src/components/LocationBar.tsx": "Provides a UI bar for setting a user's location via GPS or manual text input, geocoding the input using Nominatim and surfacing the resolved location to the parent.",
  "frontend/src/components/Navigation.tsx": "Renders the site-wide sticky header with navigation links, a mobile hamburger menu, and Internet Identity authentication controls.",
  "frontend/src/components/ProgramCard.tsx": "Displays a financial assistance program card with name, description, eligibility, and contact info.",
  "frontend/src/components/ProgressIndicator.tsx": "Shows a progress bar with percentage and completion count for appointment preparation checklist items.",
  "frontend/src/components/ResourceDirectoryItem.tsx": "Renders a community resource listing with address, phone, website, resource type badge, and optional distance from the user.",
  "frontend/src/components/ServiceCategoryCard.tsx": "Displays a healthcare service card with a category icon, color-coded badge, description, and contact info.",
  "frontend/src/components/StepNavigator.tsx": "Renders previous/next navigation buttons and a dot-based step progress indicator for multi-step flows.",
  "frontend/src/components/WorkshopCard.tsx": "Empty file with no content or exports.",
  "frontend/src/data/journeys.ts": "Defines TypeScript interfaces and data for guided healthcare journeys (e.g., no insurance, confusing bill), each containing step-by-step instructions with optional tips and action links.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that creates and caches an ICP backend actor (authenticated or anonymous) using React Query, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useGeolocation.ts": "Custom React hook that wraps the browser Geolocation API, exposing status, coordinates, error state, and callbacks to request or reset location.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and provider using DFINITY's AuthClient, exposing login/logout functions, identity state, and login status to child components.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching healthcare services, insurance terms, assistance programs, and community resources from the backend actor, plus a mutation to initialize data.",
  "frontend/src/index.css": "Global stylesheet that imports fonts, configures Tailwind, and defines CSS custom properties for a warm teal-green color palette in both light and dark modes.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with React Query's QueryClientProvider and the InternetIdentityProvider.",
  "frontend/src/pages/AboutPage.tsx": "About page component displaying the organization's mission, a list of services offered, and the populations served, using Card and Button UI components.",
  "frontend/src/pages/AppointmentPrepPage.tsx": "Renders an interactive appointment preparation checklist page with sections for documents, questions to ask, and advocacy tips, including progress tracking and a print button.",
  "frontend/src/pages/EducationPage.tsx": "Empty file with no content or exports.",
  "frontend/src/pages/FinancialAssistancePage.tsx": "Displays a filterable list of financial assistance programs (e.g., MassHealth, charity care) fetched from the backend with fallback static data, organized by category tags.",
  "frontend/src/pages/FindCarePage.tsx": "Renders a filterable directory of local healthcare services by category (Urgent Care, Routine Care, Specialist, Community Health) using backend data with static fallback entries.",
  "frontend/src/pages/GuidedJourneyPage.tsx": "Displays a step-by-step guided journey page identified by route param, showing progress, step content with optional tips and action links, and navigation controls.",
  "frontend/src/pages/HomePage.tsx": "Renders the home page with a hero section, a grid of quick-link cards to major site sections, and a 'what we do' feature list.",
  "frontend/src/pages/InsuranceGuidePage.tsx": "Displays a searchable glossary of insurance terms, fetching them from the backend via a custom hook and falling back to a hardcoded list of common terms if the backend returns none.",
  "frontend/src/pages/MedicalBillGuidePage.tsx": "Renders a static educational guide for understanding medical bills, covering how to read a bill, common billing errors, and payment/assistance options using step and accordion components.",
  "frontend/src/pages/NavigationToolsPage.tsx": "Displays a grid of guided healthcare journey cards sourced from a data file, along with a three-step explanation of how the guided journeys work.",
  "frontend/src/pages/ResourcesPage.tsx": "Shows a filterable, location-aware directory of community health resources, sorting and filtering them by resource type and proximity using geolocation or manual location input, with a hardcoded fallback list.",
  "frontend/src/utils/locationUtils.ts": "Provides utility functions for location-based resource sorting and filtering, including zip code extraction, numeric zip distance heuristics, haversine geographic distance calculation, and combined sort/filter helpers.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS with custom fonts (Nunito, Lora), an oklch-based color system, extended border radii, box shadows, animations, and plugins for typography, container queries, and animate.",
  "project_state.json": "Tracks the overall state of the Healthcare Navigation Help web app project, including version, architectural notes, known issues, and a detailed list of existing and planned features with their requirements. Serves as the central source of truth for project planning and feature tracking."
}