{
  "backend/main.mo": "Motoko actor defining the backend for a healthcare navigation app; manages persistent maps of healthcare services, insurance terms, assistance programs, and community resources with CRUD and query functions.",
  "feature_evidence.json": "Feature evidence report documenting two implemented features: creating the RightsPage.tsx informational page and registering its route/navigation links in App.tsx, Navigation.tsx, and HomePage.tsx.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend source files, describing the purpose and key changes of each component, page, hook, and utility in the project.",
  "frontend/index.css": "Global Tailwind CSS entry point defining CSS custom properties for the design system's color tokens in both light and dark modes.",
  "frontend/index.html": "Root HTML shell for the HealthBridge React app, setting metadata, favicon, description, and mounting the React app at the #root div.",
  "frontend/public/google1953233d208de426.html": "Static Google Search Console site verification file containing the standard verification token.",
  "frontend/public/site-verification.html": "Static placeholder HTML page for site verification tools, with basic centered layout and instructions for customization.",
  "frontend/src/App.tsx": "Defines the TanStack Router configuration with 12 routes including the new /healthcare-rights route, wrapping all pages in a persistent Navigation and Footer layout.",
  "frontend/src/components/CalloutBox.tsx": "Reusable callout box component supporting info, tip, warning, and right variants with corresponding icons and color styling.",
  "frontend/src/components/ChecklistSection.tsx": "Renders a titled checklist section with toggleable checkbox items that show completion count and apply strikethrough styling when checked.",
  "frontend/src/components/GuideStep.tsx": "Displays a numbered step in a guide with a circular step indicator, connector line, title, and content slot.",
  "frontend/src/components/HeroSection.tsx": "Renders the homepage hero section with a banner image, headline, CTA buttons linking to find-care and navigation-tools pages, and a stats bar highlighting community, free guidance, and nationwide coverage.",
  "frontend/src/components/InsuranceTermCard.tsx": "Displays a single insurance term and its definition inside a styled card component.",
  "frontend/src/components/JourneyCard.tsx": "Renders a card for a guided healthcare journey, showing its icon, title, description, step count, and a link to start the journey.",
  "frontend/src/components/LocationBar.tsx": "Provides a UI bar for setting a user's location via GPS or manual text input (geocoded via Nominatim), displaying the active location and allowing it to be cleared.",
  "frontend/src/components/Navigation.tsx": "Renders the sticky site-wide navigation header with links to all major pages, Internet Identity authentication (login/logout), and a responsive mobile menu.",
  "frontend/src/components/ProgramCard.tsx": "Displays a financial assistance program card with its name, description, eligibility requirements, and contact info.",
  "frontend/src/components/ProgressIndicator.tsx": "Shows a progress bar with percentage and item count for appointment preparation checklist completion, with a congratulatory message at 100%.",
  "frontend/src/components/ResourceDirectoryItem.tsx": "Renders a community resource listing with name, type badge, address, phone, optional website, and optional distance from the user's location.",
  "frontend/src/components/ServiceCategoryCard.tsx": "Displays a healthcare service card with a category icon, color-coded badge, description, and optional contact info.",
  "frontend/src/components/StepNavigator.tsx": "Renders previous/next navigation buttons and a dot-based step indicator for multi-step journey flows.",
  "frontend/src/components/WorkshopCard.tsx": "Empty file with no content or exports.",
  "frontend/src/data/journeys.ts": "Defines TypeScript interfaces and data for guided healthcare journeys (e.g., no insurance, confusing bill), each containing step-by-step instructions with optional actions and tips.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that creates and caches an ICP backend actor (authenticated or anonymous) using React Query, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useGeolocation.ts": "Custom React hook that wraps the browser Geolocation API, exposing status, coordinates, error state, and callbacks to request or reset location.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and provider using DFINITY's AuthClient, exposing login/logout functions and identity state to child components.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching healthcare services, insurance terms, assistance programs, and community resources from the ICP backend actor, plus a mutation to initialize data.",
  "frontend/src/index.css": "Global stylesheet that imports fonts, configures Tailwind, and defines CSS custom properties for a warm teal-green color palette in both light and dark modes.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with React Query's QueryClientProvider and the InternetIdentityProvider.",
  "frontend/src/pages/AboutPage.tsx": "About page component displaying the organization's mission, who it serves, and a grid of services offered, using Lucide icons and shadcn UI components.",
  "frontend/src/pages/AppointmentPrepPage.tsx": "Renders an appointment preparation page with an interactive checklist, suggested questions to ask a doctor, and patient advocacy tips. Tracks checklist progress with a completion percentage.",
  "frontend/src/pages/ChallengesPage.tsx": "Displays a page outlining common healthcare access barriers (cost, insurance, language, transportation, etc.) along with affordability tips and billing pitfall warnings. Uses cards and alerts to present actionable guidance.",
  "frontend/src/pages/EducationPage.tsx": "Empty file with no content or exports.",
  "frontend/src/pages/FinancialAssistancePage.tsx": "Shows a filterable list of financial assistance programs (Medicaid, CHIP, charity care, etc.) fetched via a query hook with fallback static data. Users can filter programs by tag category.",
  "frontend/src/pages/FindCarePage.tsx": "Displays filterable healthcare service options (urgent care, routine care, specialists, community health) fetched from the backend with static fallback data. Includes category-specific guidance text to help users choose the right care type.",
  "frontend/src/pages/GuidedJourneyPage.tsx": "Renders a step-by-step guided journey page identified by a URL parameter, showing progress, step content with optional tips and action links, and navigation controls. Displays a not-found state if the journey ID is unrecognized.",
  "frontend/src/pages/HomePage.tsx": "The main landing page displaying a hero section, a grid of quick-link cards to major site sections, and a 'What We Do' checklist summarizing the platform's capabilities.",
  "frontend/src/pages/InsuranceGuidePage.tsx": "A searchable glossary page for insurance terms that fetches terms from the backend via a custom hook and falls back to a hardcoded list of common terms if the backend returns none.",
  "frontend/src/pages/MedicalBillGuidePage.tsx": "A static guide page explaining how to read, review, and dispute medical bills, including step-by-step instructions, common billing errors, and negotiation tips.",
  "frontend/src/pages/NavigationToolsPage.tsx": "Displays a grid of guided healthcare journey cards sourced from a local data file, along with a three-step explanation of how the guided journeys work.",
  "frontend/src/pages/ResourcesPage.tsx": "A community resources directory page that fetches resources from the backend, supports filtering by resource type, and sorts or filters results by the user's geolocation or manually entered ZIP code.",
  "frontend/src/pages/RightsPage.tsx": "A static informational page outlining key patient rights across categories such as emergency care, billing disputes, language assistance, medical records access, and the right to a second opinion.",
  "frontend/src/utils/locationUtils.ts": "Provides utility functions for location-based resource sorting and filtering, including zip code extraction, numeric zip distance heuristic, haversine geographic distance calculation, and helpers to sort/filter CommunityResource arrays by proximity.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining dark mode, custom fonts (Nunito, Lora), an extended color palette using OKLCH variables, border radii, box shadows, keyframe animations, and plugins for typography, container queries, and animate.",
  "project_state.json": "Tracks overall project state (version 25) for the Healthcare Navigation Help web app, documenting the mission, architectural notes, known issues, and a catalog of existing and planned features for the community healthcare navigation tool."
}