{
  "backend/main.mo": "Motoko actor defining data types and persistent maps for healthcare services, insurance terms, assistance programs, community resources, and workshops, with initialization and query functions for a healthcare navigation app.",
  "feature_evidence.json": "Feature evidence report mapping each product feature (hero section, find care, insurance glossary, appointment checklist, etc.) to their implementing frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "JSON snippet providing one-sentence summaries for three frontend files: App.tsx (router setup), EducationPage.tsx (workshops page), and AboutPage.tsx (mission/vision page).",
  "frontend/index.css": "Global Tailwind CSS entry point that defines CSS custom property design tokens for light and dark themes including colors, radius, and sidebar variables.",
  "frontend/index.html": "Minimal HTML shell for the React SPA titled 'Healthcare Navigation Help' that mounts the app into a root div and loads the main TypeScript entry point.",
  "frontend/src/App.tsx": "Main React application file that configures TanStack Router with a persistent Navigation/Footer root layout and registers all 11 page routes including a dynamic journey route.",
  "frontend/src/components/CalloutBox.tsx": "Reusable callout/alert box component supporting four variants (info, tip, warning, right) with corresponding icons and color styling using Lucide icons.",
  "frontend/src/components/ChecklistSection.tsx": "Interactive checklist section component that renders a titled group of checkable items with completion progress, strikethrough on completion, and toggle callbacks.",
  "frontend/src/components/GuideStep.tsx": "Numbered guide step component that displays a step number in a circular badge, a title, and child content with a vertical connector line for use in sequential guides.",
  "frontend/src/components/HeroSection.tsx": "Hero banner component featuring a full-width image with gradient overlay, the mission statement, two CTA buttons linking to find-care and navigation-tools, and a stats bar with community/free/local highlights.",
  "frontend/src/components/InsuranceTermCard.tsx": "Card component that displays a single insurance term and its plain-language definition, typed against the backend InsuranceTerm type.",
  "frontend/src/components/JourneyCard.tsx": "Renders a card for a healthcare journey with its icon, title, description, step count, and a link to start the journey.",
  "frontend/src/components/Navigation.tsx": "Provides a sticky top navigation header with desktop and mobile (hamburger) menus linking to all app pages, plus a footer component.",
  "frontend/src/components/ProgramCard.tsx": "Displays a financial assistance program card showing its name, description, eligibility requirements, and contact info.",
  "frontend/src/components/ProgressIndicator.tsx": "Shows a progress bar with completed/total item counts and percentage, with a completion message at 100%.",
  "frontend/src/components/ResourceDirectoryItem.tsx": "Renders a community resource listing with address, phone, optional website, and a color-coded resource type badge.",
  "frontend/src/components/ServiceCategoryCard.tsx": "Displays a healthcare service card with a category icon, color-coded badge, description, and optional contact info.",
  "frontend/src/components/StepNavigator.tsx": "Renders previous/next navigation buttons and a dot-based step indicator for multi-step flows.",
  "frontend/src/components/WorkshopCard.tsx": "Displays a workshop card with title, description, audience, optional date, and optional location details.",
  "frontend/src/data/journeys.ts": "Defines the Journey and JourneyStep TypeScript interfaces and exports an array of guided healthcare journeys (e.g., no insurance, confusing bill) with step-by-step instructions.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor (authenticated or anonymous) using the current Internet Identity, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication on the ICP platform, managing login state, identity persistence, and AuthClient lifecycle.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching healthcare services, insurance terms, assistance programs, community resources, and workshops from the backend actor, plus a mutation to initialize data.",
  "frontend/src/index.css": "Global stylesheet importing Tailwind CSS and Google Fonts, defining a warm teal-green CSS custom property theme with light/dark mode variants and print styles.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AboutPage.tsx": "Static About page describing the Healthcare Navigation Help program's mission, services offered, and the communities it serves.",
  "frontend/src/pages/AppointmentPrepPage.tsx": "Interactive appointment preparation checklist page with sections for documents, questions to ask, and advocacy tips, including progress tracking and a print option.",
  "frontend/src/pages/EducationPage.tsx": "Education page displaying filterable workshops and guides fetched from the backend (with fallback static data), categorized into Workshop, Guide, and Advocacy types.",
  "frontend/src/pages/FinancialAssistancePage.tsx": "Displays a filterable list of financial assistance programs (e.g., MassHealth, charity care) with tag-based filtering. Falls back to hardcoded program data if the backend returns nothing.",
  "frontend/src/pages/FindCarePage.tsx": "Renders a filterable directory of local healthcare services grouped by category (Urgent Care, Routine Care, etc.). Uses backend data when available, otherwise falls back to hardcoded service entries.",
  "frontend/src/pages/GuidedJourneyPage.tsx": "Step-by-step guided journey page that reads a journeyId route param, displays progress, and lets users navigate through journey steps with tips and action links.",
  "frontend/src/pages/HomePage.tsx": "Landing page featuring a hero section, a grid of quick-link cards to major site sections, and a 'what we do' checklist summarizing the platform's purpose.",
  "frontend/src/pages/InsuranceGuidePage.tsx": "Searchable glossary of insurance terms with definitions, using backend data or a comprehensive hardcoded fallback list when the backend is empty.",
  "frontend/src/pages/MedicalBillGuidePage.tsx": "A detailed guide page for understanding medical bills, covering how to read a bill, common billing errors, and payment/assistance options using accordion and callout components.",
  "frontend/src/pages/NavigationToolsPage.tsx": "A page displaying guided healthcare journey cards fetched from a journeys data source, with a three-step explanation of how the guided journeys work.",
  "frontend/src/pages/ResourcesPage.tsx": "A filterable community resource directory page for Leominster, MA that fetches resources via a query hook and falls back to hardcoded local resources if none are returned.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom fonts (Nunito/Lora), OKLCH-based color tokens, border radii, box shadows, and animations, with typography, container-queries, and animate plugins.",
  "project_state.json": "Project state metadata describing Healthcare Navigation Help, a community web app for Leominster, MA residents, including its architecture notes, existing features, and image requirements."
}