{
  "kind": "build_request",
  "title": "Add a new informational page: Understanding Your Healthcare Rights",
  "projectName": "Healthcare Navigation Help",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-34",
      "text": "Create a new informational page (e.g., RightsPage.tsx) titled 'Know Your Healthcare Rights' that educates users about their fundamental rights as patients and healthcare consumers. Include sections covering: (1) the right to receive emergency care regardless of insurance status or ability to pay, (2) the right to receive an itemized bill and dispute charges, (3) the right to request an interpreter or language assistance services, (4) the right to access and obtain copies of your medical records, (5) the right to a second opinion, (6) the right to appeal insurance denials, and (7) protections against surprise billing. Present content using cards, callout boxes, and short readable sections consistent with the existing warm teal-green design system (matching the style of ChallengesPage.tsx and other informational pages in the app).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Add another information page"
        ]
      },
      "acceptanceCriteria": [
        "A new page component file exists (e.g., frontend/src/pages/RightsPage.tsx) and renders without errors.",
        "The page includes at least 6 distinct content sections covering patient rights topics.",
        "Content uses cards, callout boxes, or equivalent styled components consistent with the warm teal-green design system.",
        "No references to specific states, cities, or location-specific programs appear in the page content.",
        "Language is plain, accessible, and universally applicable to users anywhere in the country."
      ]
    },
    {
      "id": "REQ-35",
      "text": "Register the new Rights page as a route in App.tsx (e.g., at path '/healthcare-rights') and add a navigation link for it in Navigation.tsx so users can discover and access it from the persistent site-wide nav bar. Additionally, add a quick-link card for the Rights page on the HomePage quick-links grid so users can find it from the main entry point of the app.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Add another information page"
        ]
      },
      "acceptanceCriteria": [
        "A route for the Rights page is defined in App.tsx and navigating to its path renders the new page.",
        "A link to the Rights page appears in Navigation.tsx alongside the other nav links.",
        "A quick-link card for the Rights page is visible in the HomePage quick-links grid.",
        "All navigation links are styled consistently with existing nav items."
      ]
    }
  ],
  "constraints": [
    "Do not modify any files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or frontend/src/components/ui.",
    "All user-facing text must use universal, location-neutral language — no references to Leominster, Massachusetts, or any specific state or city.",
    "Visual style must be consistent with the existing warm teal-green design system used throughout the app."
  ],
  "nonGoals": [
    "No backend changes are required for this page — it is static informational content only.",
    "Do not add legal advice or jurisdiction-specific legal language.",
    "Do not add any new backend data types or query functions."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}