{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Real location-based resource lookup for any city, zip code, or address",
  "requirements": [
    {
      "id": "REQ-22",
      "summary": "Integrate free geocoding API (Nominatim/OpenStreetMap) in ResourcesPage.tsx to resolve manual location input (zip code, city name, or address) into latitude/longitude coordinates, then use those coordinates for proximity-based resource sorting",
      "acceptanceCriteria": [
        "Typing 'Miami' (or any city/zip/address) into the location input and submitting resolves to lat/lng coordinates via geocoding.",
        "The active location display updates to reflect the resolved location name (e.g., 'Showing resources near: Miami, FL').",
        "Resources are sorted by proximity to the resolved coordinates, not by zip-code string matching alone.",
        "If geocoding fails or returns no results, display a user-friendly message such as 'Could not find that location. Please try a different city, zip code, or address.'",
        "Geolocation (Use My Location) behavior is unchanged and continues to work as before."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/LocationBar.tsx",
          "operation": "modify",
          "description": "Add geocoding logic using the browser's native fetch to call the Nominatim API (https://nominatim.openstreetmap.org/search) when the user submits manual location input. Parse the API response to extract latitude, longitude, and display name. Update the active location state to include resolved coordinates and location name. Add error handling to display a user-friendly message when geocoding fails or returns no results. Preserve existing geolocation (Use My Location) behavior without modification."
        },
        {
          "path": "frontend/src/pages/ResourcesPage.tsx",
          "operation": "modify",
          "description": "Receive resolved coordinates from LocationBar and store them as the active location context. Update the active location display label to show the resolved location name (e.g., 'Showing resources near: Miami, FL'). Pass the active coordinates to the proximity sorting logic in locationUtils.ts instead of relying solely on zip-code string matching. Ensure the existing geolocation flow continues to work unchanged."
        }
      ]
    },
    {
      "id": "REQ-23",
      "summary": "Extend the static fallback resource data in ResourcesPage.tsx to include latitude and longitude fields for each resource entry, and populate realistic coordinates for existing Leominster-area resources",
      "acceptanceCriteria": [
        "CommunityResource type in backend/main.mo includes optional lat and lng Float fields.",
        "All existing sample resource entries in backend initialization data have lat/lng values populated.",
        "The static fallback resource array in ResourcesPage.tsx includes lat/lng for each entry.",
        "The proximity sort function in locationUtils.ts (or ResourcesPage.tsx) uses resource lat/lng coordinates when available.",
        "Resources without lat/lng gracefully fall back to zip-code-based proximity or appear at the end of sorted results."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/ResourcesPage.tsx",
          "operation": "modify",
          "description": "Add optional lat and lng number fields to the CommunityResource type definition in the static fallback data array. Populate realistic latitude and longitude coordinates for all existing Leominster-area resource entries (Leominster, MA is approximately lat 42.5251, lng -71.7598). Ensure the fallback data structure matches the updated backend CommunityResource type from backend.d.ts."
        }
      ]
    },
    {
      "id": "REQ-24",
      "summary": "Implement haversine distance calculation in locationUtils.ts to sort resources by actual geographic distance from active location coordinates, and display computed distance next to each resource",
      "acceptanceCriteria": [
        "locationUtils.ts exports a haversine distance function that accepts two lat/lng pairs and returns distance in miles.",
        "When a location is active, resources are sorted by ascending distance from that location.",
        "Each resource card/row displays an approximate distance label (e.g., '~5 miles away') when a location is active.",
        "Resources without lat/lng data appear below those with coordinates and show no distance label.",
        "Distance labels are hidden when no location is active."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/locationUtils.ts",
          "operation": "modify",
          "description": "Add a haversine distance calculation function that accepts two lat/lng coordinate pairs and returns the distance in miles. Replace or augment the existing zip-code numeric comparison approach with coordinate-based distance sorting. When an active location has coordinates (from geolocation or geocoding), sort all resources with known lat/lng by ascending haversine distance. Resources without coordinates should fall to the bottom of the sorted list. Export a function that calculates and returns the distance for display purposes."
        },
        {
          "path": "frontend/src/components/ResourceDirectoryItem.tsx",
          "operation": "modify",
          "description": "Accept an optional distance prop (number representing miles) and display it as a label (e.g., '~3 miles away') next to the resource name or address when provided. Hide the distance label when the distance prop is not provided or when no location is active. Ensure the distance display integrates cleanly with the existing resource card layout and does not disrupt the type badge, address, phone, or website link elements."
        },
        {
          "path": "frontend/src/pages/ResourcesPage.tsx",
          "operation": "modify",
          "description": "When rendering filtered resources, calculate the distance for each resource using the haversine function from locationUtils.ts if both the active location coordinates and resource lat/lng are available. Pass the computed distance to each ResourceDirectoryItem component. Ensure resources without lat/lng appear at the bottom of the list and receive no distance prop. Only compute and display distances when a location is active (either from geolocation or geocoding)."
        }
      ]
    }
  ]
}