{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add Healthcare Rights Informational Page",
  "requirements": [
    {
      "id": "REQ-34",
      "summary": "Create a new informational page titled 'Know Your Healthcare Rights' that educates users about their fundamental rights as patients and healthcare consumers, covering emergency care rights, billing rights, language assistance, medical records access, second opinions, insurance appeals, and surprise billing protections",
      "acceptanceCriteria": [
        "A new page component file exists (e.g., frontend/src/pages/RightsPage.tsx) and renders without errors.",
        "The page includes at least 6 distinct content sections covering patient rights topics.",
        "Content uses cards, callout boxes, or equivalent styled components consistent with the warm teal-green design system.",
        "No references to specific states, cities, or location-specific programs appear in the page content.",
        "Language is plain, accessible, and universally applicable to users anywhere in the country."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/RightsPage.tsx",
          "operation": "create",
          "description": "Create a new page component that presents patient healthcare rights information in 7 distinct sections: (1) emergency care rights, (2) billing and dispute rights, (3) language assistance rights, (4) medical records access, (5) second opinion rights, (6) insurance appeal rights, and (7) surprise billing protections. Use Card components from shadcn-ui and CalloutBox components (info/tip variants) to organize content with consistent warm teal-green styling matching ChallengesPage.tsx and other informational pages. Present content using short readable sections with headings, bullet points, and actionable guidance. Ensure all language is location-neutral, plain, and universally applicable."
        }
      ]
    },
    {
      "id": "REQ-35",
      "summary": "Register the new Rights page as a route in App.tsx at path '/healthcare-rights', add a navigation link in Navigation.tsx, and add a quick-link card on the HomePage quick-links grid",
      "acceptanceCriteria": [
        "A route for the Rights page is defined in App.tsx and navigating to its path renders the new page.",
        "A link to the Rights page appears in Navigation.tsx alongside the other nav links.",
        "A quick-link card for the Rights page is visible in the HomePage quick-links grid.",
        "All navigation links are styled consistently with existing nav items."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Register a new route for the Rights page at path '/healthcare-rights' using the TanStack Router configuration pattern already in place. Import RightsPage from 'frontend/src/pages/RightsPage.tsx' and add it to the router configuration alongside the existing 11 routes (AboutPage, HomePage, ChallengesPage, etc.). Ensure the route is wrapped in the persistent Navigation/Footer layout consistent with all other page routes."
        },
        {
          "path": "frontend/src/components/Navigation.tsx",
          "operation": "modify",
          "description": "Add a navigation link for the Healthcare Rights page to the main navigation bar. Insert a Link component pointing to '/healthcare-rights' with the text 'Know Your Rights' (or similar concise label) in both the desktop navigation links and the mobile hamburger menu, maintaining consistency with existing nav link styling and ordering. Position the link logically within the existing navigation structure (e.g., after 'Challenges' or 'Financial Assistance')."
        },
        {
          "path": "frontend/src/pages/HomePage.tsx",
          "operation": "modify",
          "description": "Add a quick-link card for the Healthcare Rights page to the existing quick-links grid on the HomePage. Insert a new Card component in the grid with an appropriate icon (e.g., Shield, Scale, or FileText from lucide-react), the title 'Know Your Rights', a short description (e.g., 'Learn about your fundamental rights as a patient and healthcare consumer'), and a Link to '/healthcare-rights'. Style the card consistently with the existing quick-link cards in the grid."
        }
      ]
    }
  ]
}